In [1]:
import numpy as np 
import pandas as pd

In [10]:
dict1 ={
    "name":['harry','rohan','skillf','shubh'],
    "marks":[92,34,24,17],
    "City":['rampur','kolkata','bareilly','antartica']  
}

In [11]:
df = pd.DataFrame(dict1)

In [12]:
df

     name  marks       City
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [16]:
df . to_csv('friends.csv')

SyntaxError: invalid syntax (1650995221.py, line 1)